InformationRegisters/бит_ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/бит_НастройкаПравДоступа/Ext/Module.bsl
#Область ОбслуживаниеМеханизмаНастройкиПравДоступа

// Проверка возможности записи данных документа с учетом даты запрета изменения данных (даты запрета редактирования).
//
Процедура ПередЗаписьюДокументовПроверкаДоступностиПериода(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаПериодаДокумента(Источник, Отказ);
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Редактирование данных этого периода запрещено! Изменения не могут быть записаны.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры	// ПередЗаписьюДокументовПроверкаДоступностиПериода

// Процедура проверки возможности записи (изменения). 
// Данных документа с учетом даты запрета изменения данных (даты запрета редактирования).
//
Процедура ПроверкаПериодаДокумента(ДокументОбъект, Отказ, РежимЗаписи = Неопределено)
	
	// БИТ_ЖКХ 07.02.2014{{	
	// СоответствиеГраницЗапрета = ПараметрыСеанса.бит_ГраницыЗапретаИзмененияДанных.Получить();.
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		
		НаборЗаписей.Прочитать();
		
		СоответствиеГраницЗапрета = Новый Соответствие;
		Для каждого строка из НаборЗаписей Цикл
			
			СоответствиеГраницЗапрета.Вставить(строка.Организация,строка.ГраницаЗапретаИзменений);
			
		КонецЦикла;	
		
	Исключение

		Возврат;

	КонецПопытки;	
	// БИТ_ЖКХ 07.02.2014}}
	
	// Для пользователя с полными правами проверок выполнять не нужно.
	Если СоответствиеГраницЗапрета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверкиДокумента = ПолучитьПараметрыПроверкиДокумента(ДокументОбъект);
	
	Если Не ДокументОбъект.ЭтоНовый() Тогда
		СтараяВерсияДокумента = ПолучитьВерсиюДокументаПередИзменением(ДокументОбъект, ПараметрыПроверкиДокумента);
		ПроверитьВерсиюДокумента(СтараяВерсияДокумента, ПараметрыПроверкиДокумента, СоответствиеГраницЗапрета, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПроверитьВерсиюДокумента(ДокументОбъект, ПараметрыПроверкиДокумента, СоответствиеГраницЗапрета, Отказ, РежимЗаписи);
	КонецЕсли;
	
КонецПроцедуры // ПроверкаПериодаДокумента

// Функция возвращает структуру с параметрами проверки документа по умолчанию.
//
Функция ПолучитьПараметрыПроверкиДокумента(ДокументОбъект) Экспорт
	
	ПараметрыПроверкиДокумента = Новый Структура;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ПараметрыПроверкиДокумента.Вставить("МетаданныеДокумента", МетаданныеДокумента);
	
	// Если  в документе есть реквизит организация, дата запрета определяется с учетом организации.
	ПараметрыПроверкиДокумента.Вставить("ЕстьОрганизация", 			    (МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено) 
	ИЛИ (МетаданныеДокумента.Реквизиты.Найти("ЛицевойСчет") <> Неопределено)
	ИЛИ (МетаданныеДокумента.Реквизиты.Найти("Объект")      <> Неопределено));
	
	// Если для документа проведение запрещено, проверка на дату запрета редактирования.
	// Проверяется без учета проведенности.
	ПараметрыПроверкиДокумента.Вставить("ПроверятьПроведениеДокумента", (МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить));
	
	Если ЗаполнитьПараметрыПроверкиПоВидуДокумента(ДокументОбъект, ПараметрыПроверкиДокумента) Тогда
		Возврат ПараметрыПроверкиДокумента;
	КонецЕсли;
	
	ПараметрыПроверкиДокумента.Вставить("ПроверятьУправленческуюДатуЗапрета", 		Ложь);
	ПараметрыПроверкиДокумента.Вставить("ПроверятьРегламентированнуюДатуЗапрета", 	ПараметрыПроверкиДокумента.ЕстьОрганизация);	
	
	Возврат ПараметрыПроверкиДокумента;
	
КонецФункции // ПолучитьПараметрыПроверкиДокумента()

// Функция возвращает из БД версию документа до его изменения.
//
Функция ПолучитьВерсиюДокументаПередИзменением(ДокументОбъект, ПараметрыПроверкиДокумента)
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
		Организация = "Организация КАК Организация";
	ИначеЕсли (МетаданныеДокумента.Реквизиты.Найти("ЛицевойСчет") <> Неопределено) Тогда
		Организация = "ЛицевойСчет.Организация КАК Организация";
	ИначеЕсли (МетаданныеДокумента.Реквизиты.Найти("Объект") <> Неопределено) Тогда
		Организация = "Объект.Организация КАК Организация";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|Дата" 
	+ ?(ПараметрыПроверкиДокумента.ЕстьОрганизация, "," + Символы.ПС + Организация, "")
	+ ?(ПараметрыПроверкиДокумента.ПроверятьПроведениеДокумента, "," + Символы.ПС + "Проведен КАК Проведен", "") + "	
	|ИЗ Документ." + ПараметрыПроверкиДокумента.МетаданныеДокумента.Имя + "
	|ГДЕ Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка;
	
КонецФункции // ПолучитьВерсиюДокументаПередИзменением()

// Процедура проверки версии документа на нарушение даты запрета.
//
Процедура ПроверитьВерсиюДокумента(ДокументОбъект, ПараметрыПроверкиДокумента, СоответствиеГраницЗапрета, Отказ, РежимЗаписи = Неопределено) Экспорт
	
	МетаданныеДокумента =?(ТипЗнч(ДокументОбъект) = Тип("ВыборкаИзРезультатаЗапроса"),Неопределено,ДокументОбъект.Метаданные());
	
	Если ПараметрыПроверкиДокумента.ПроверятьПроведениеДокумента Тогда		
		ДокументПроведен = ДокументОбъект.Проведен ИЛИ ?(РежимЗаписи = Неопределено, ЛОЖЬ, РежимЗаписи = РежимЗаписиДокумента.Проведение);
		Если Не ДокументПроведен Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	// Не выполняется проверка дат запрета редактирования.
	Если НЕ ПараметрыПроверкиДокумента.ПроверятьУправленческуюДатуЗапрета и
		НЕ ПараметрыПроверкиДокумента.ПроверятьРегламентированнуюДатуЗапрета Тогда
		
		Возврат;
	КонецЕсли;	
	
	// Проверка регламентированной даты запрета.
	Если ПараметрыПроверкиДокумента.ПроверятьРегламентированнуюДатуЗапрета Тогда
		
		Если МетаданныеДокумента <> Неопределено Тогда
			Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
				Организация = ДокументОбъект.Организация;
			ИначеЕсли (МетаданныеДокумента.Реквизиты.Найти("ЛицевойСчет") <> Неопределено) Тогда
				Организация = ДокументОбъект.ЛицевойСчет.Организация;
			ИначеЕсли (МетаданныеДокумента.Реквизиты.Найти("Объект") <> Неопределено) Тогда
				Организация = ДокументОбъект.Объект.Организация;
			КонецЕсли;
		Иначе
			Организация = ДокументОбъект.Организация;
		КонецЕсли;
		
		ГраницаПоОрганизации = СоответствиеГраницЗапрета[Организация];
		
		// Если регламентированная дата запрета для регламентного документа не определена.
		// То используется общая дата запрета изменения данных.
		Если ГраницаПоОрганизации = Неопределено Тогда
			ГраницаПоОрганизации = СоответствиеГраницЗапрета["ОбщаяДатаЗапретаРедактирования"];    
		КонецЕсли;
		
		Если НЕ ГраницаПоОрганизации = Неопределено 
			И ДокументОбъект.Дата <= ГраницаПоОрганизации	Тогда
			
			Отказ = Истина;			
		КонецЕсли;		
	КонецЕсли;		    
	
	// Проверка управленческой даты запрета.
	Если ПараметрыПроверкиДокумента.ПроверятьУправленческуюДатуЗапрета Тогда        
		ГраницаПериода = СоответствиеГраницЗапрета[Справочники.Организации.ПустаяСсылка()];       
		// Если управленческая дата запрета для управленческого документа не определена.
		// То используется общая дата запрета изменения данных.
		Если ГраницаПоОрганизации = Неопределено Тогда
			ГраницаПоОрганизации = СоответствиеГраницЗапрета[Справочники.Организации.ПустаяСсылка()];    
		КонецЕсли;
		
		Если ГраницаПериода <> Неопределено Тогда
			
			Если ДокументОбъект.Дата <= ГраницаПериода Тогда
				Отказ = Истина;				
			КонецЕсли;         			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьВерсиюДокумента()

// Функция возвращает структуру параметров проверки документа для нетиповых случаев.
//
Функция ЗаполнитьПараметрыПроверкиПоВидуДокумента(ДокументОбъект, ПараметрыПроверкиДокумента)
	
	Возврат Ложь;
	
КонецФункции // ЗаполнитьПараметрыПроверкиПоВидуДокумента()

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Проверка возможности изменения записей регистров (дата запрета изменения данных).
//
Процедура ПередЗаписьюРегистраНакопленийПроверкаДоступностиПериода(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаПериодаЗаписейРегистров(Источник, Отказ);
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Редактирование данных этого периода запрещено! Изменения не могут быть записаны.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюРегистраНакопленийПроверкаДоступностиПериода

// Процедура выполняет проверку возможности записи регистров сведений и регистров накопления.
// С учетом даты запрета изменения данных (даты запрета редактирования).
//
Процедура ПроверкаПериодаЗаписейРегистров(НаборЗаписей, Отказ)
	
	// БИТ_ЖКХ 13.02.2015{{
	// СоответствиеГраницЗапрета = ПараметрыСеанса.бит_ГраницыЗапретаИзмененияДанных.Получить();.
	// СоответствиеГраницЗапрета = бит_ОбщегоНазначения.ПолучитьПараметрСеанса("бит_ГраницыЗапретаИзмененияДанных");.
	Попытка
		
		// СоответствиеГраницЗапрета = бит_ОбщегоНазначения.ПолучитьПараметрСеанса("бит_ГраницыЗапретаИзмененияДанных");.
		НаборЗаписейГраницыЗапретаИзмененияДанных = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		
		НаборЗаписейГраницыЗапретаИзмененияДанных.Прочитать();
		
		СоответствиеГраницЗапрета = Новый Соответствие;
		Для каждого строка из НаборЗаписейГраницыЗапретаИзмененияДанных Цикл
			
			СоответствиеГраницЗапрета.Вставить(строка.Организация,строка.ГраницаЗапретаИзменений);
			
		КонецЦикла;	
		
	Исключение
		
		СоответствиеГраницЗапрета = Неопределено
		
	КонецПопытки;
	// БИТ_ЖКХ 13.02.2015}}
	
	// Для пользователя с полными правами проверок выполнять не нужно.
	
	// БИТ_ЖКХ 02.03.2015{{
	// Если СоответствиеГраницЗапрета = Неопределено Тогда.
	Если СоответствиеГраницЗапрета = Неопределено или СоответствиеГраницЗапрета.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	ЕстьДатаЗапрета = Ложь;
	
	Для каждого Строка из НаборЗаписейГраницыЗапретаИзмененияДанных Цикл
		
		Если Формат(Строка.ГраницаЗапретаИзменений, "ДФ=dd.MM.yyyy") = "01.01.0001" Тогда
			
			Продолжить;
			
		Иначе
			
			ЕстьДатаЗапрета = Истина;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если ЕстьДатаЗапрета = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;	
	// БИТ_ЖКХ 02.03.2015}}	
		
	МетаданныеНабора = НаборЗаписей.Метаданные();		
	ЕстьОрганизация = (МетаданныеНабора.Измерения.Найти("Организация")<>Неопределено);
	
	// Проверку существующих записей выполняем только для регистров сведений, подчиненных регистратору,
	// Регистрам накопления и регистрам бухгалтерии.
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СоответствиеГраницЗапрета", 	СоответствиеГраницЗапрета);
	СтруктураПараметров.Вставить("МетаданныеНабора", 			МетаданныеНабора);
	СтруктураПараметров.Вставить("ЕстьОрганизация", 			ЕстьОрганизация);
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеНабора) И НЕ МетаданныеНабора.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		ПроверкаСуществующихЗаписейРегистраСОтборомПоИзмерениям(НаборЗаписей, СтруктураПараметров, Отказ);
	Иначе
		ПроверкаСуществующихЗаписейРегистра(НаборЗаписей, СтруктураПараметров, Отказ);
	КонецЕсли;
	
	Если НаборЗаписей.Количество() > 0 И НЕ Отказ Тогда				
		Отказ = Ложь;
		Если ЕстьОрганизация Тогда
			Для Каждого Запись ИЗ НаборЗаписей Цикл
				ГраницаПоОрганизации = СоответствиеГраницЗапрета[Запись.Организация];
				ЕСли ГраницаПоОрганизации <> Неопределено 
					И Запись.Период <= ГраницаПоОрганизации Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ГраницаПериода = СоответствиеГраницЗапрета[Справочники.Организации.ПустаяСсылка()];
			Если ГраницаПериода <> Неопределено Тогда
				Для Каждого Запись ИЗ НаборЗаписей Цикл
					ЕСли Запись.Период <= ГраницаПериода Тогда
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры // ПроверкаПериодаЗаписейРегистров

// БИТ_ЖКХ 12.01.2011. 
// 
Процедура ПроверкаСуществующихЗаписейРегистраСОтборомПоИзмерениям(НаборЗаписей, СтруктураПараметров, Отказ)
	
	ИмяРегистра = СтруктураПараметров.МетаданныеНабора.ПолноеИмя();
	
	// Формируем текст условия блока ГДЕ основного запроса,
	// В соответствии с установленным отбором для набора записей.
	
	Запрос = Новый Запрос;
	
	СписокПолейУсловияОтбораТекст = "";
	Итерация = 0;
	Для каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл                
		Если не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;                
		
		Если НЕ Итерация = 0  Тогда            
			СписокПолейУсловияОтбораТекст = СписокПолейУсловияОтбораТекст  + " И ";
		КонецЕсли;        
		
		СписокПолейУсловияОтбораТекст = СписокПолейУсловияОтбораТекст +" Набор." + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя;                       
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);        
		
		Итерация = 1;
	КонецЦикла; 
	
	Если Итерация = 1 Тогда
		СписокПолейУсловияОтбораТекст = " ГДЕ " + СписокПолейУсловияОтбораТекст;    	            
	КонецЕсли;                   
	
	ВложенныйЗапрос = "";
	Если СтруктураПараметров.ЕстьОрганизация Тогда
		индекс = 1;
		ИмяПоляОрганизации = "Организация";
		Для Каждого КлючИЗначение ИЗ СтруктураПараметров.СоответствиеГраницЗапрета Цикл
			ВложенныйЗапрос = ВложенныйЗапрос + ?(ВложенныйЗапрос = "", "", "
			|ОБЪЕДИНИТЬ") +"
			|ВЫБРАТЬ &Организация"+индекс+" КАК Организация, &ДатаЗапрета" + Формат(индекс, "ЧГ=0") + " КАК ДатаЗапрета";
			Запрос.УстановитьПараметр("Организация"+индекс, КлючИЗначение.Ключ);
			ГраницаПериода = КлючИЗначение.Значение;
			Запрос.УстановитьПараметр("ДатаЗапрета"+индекс, ?(ГраницаПериода=Неопределено, NULL, ГраницаПериода));
			индекс = индекс + 1;
		КонецЦикла;
	Иначе
		
		// БИТ_ЖКХ 20.04.2015{{
		Если Строка(тип(НаборЗаписей)) = "Регистр сведений набор записей: Получатели денежных средств (Биллинговые услуги)" Тогда 
			ПустаяОрганизация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		Иначе	
			ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
		// БИТ_ЖКХ 20.04.2015}}
		
		ИмяПоляОрганизации = "&ПустаяОрганизация";
		ВложенныйЗапрос = "ВЫБРАТЬ &ПустаяОрганизация КАК Организация, &ДатаЗапрета КАК ДатаЗапрета";
		Запрос.УстановитьПараметр("ПустаяОрганизация", ПустаяОрганизация);
		ГраницаПериода = СтруктураПараметров.СоответствиеГраницЗапрета[ПустаяОрганизация];
		Запрос.УстановитьПараметр("ДатаЗапрета", ?(ГраницаПериода=Неопределено, NULL, ГраницаПериода));			
	КонецЕсли;			    
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 1
	|ИЗ
	|(
	|ВЫБРАТЬ " + ИмяПоляОрганизации + " КАК Организация, МИНИМУМ(Период) КАК Период  ИЗ " + ИмяРегистра + " КАК Набор
	| "+ СписокПолейУсловияОтбораТекст + "
	|СГРУППИРОВАТЬ ПО " + ИмяПоляОрганизации + "
	|) КАК НаборЗаписей
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|(" + ВложенныйЗапрос + "		
	|) КАК ДатыЗапрета
	|ПО НаборЗаписей.Организация = ДатыЗапрета.Организация
	|ГДЕ НаборЗаписей.Период <= ДатыЗапрета.ДатаЗапрета ИЛИ ДатыЗапрета.ДатаЗапрета ЕСТЬ NULL";      
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПроверкаСуществующихЗаписейРегистраСОтборомПоИзмерениям()

// БИТ_ЖКХ 12.01.2011. 
// 
Процедура ПроверкаСуществующихЗаписейРегистра(НаборЗаписей, СтруктураПараметров, Отказ)
	
	ИмяРегистра = СтруктураПараметров.МетаданныеНабора.ПолноеИмя();
	
	Запрос = Новый Запрос;
	ВложенныйЗапрос = "";
	ЕСли СтруктураПараметров.ЕстьОрганизация Тогда
		индекс = 1;
		ИмяПоляОрганизации = "Организация";
		Для Каждого КлючИЗначение ИЗ СтруктураПараметров.СоответствиеГраницЗапрета Цикл
			ВложенныйЗапрос = ВложенныйЗапрос + ?(ВложенныйЗапрос = "", "", "
			|ОБЪЕДИНИТЬ") +"
			|ВЫБРАТЬ &Организация"+индекс+" КАК Организация, &ДатаЗапрета" + Формат(индекс, "ЧГ=0") + " КАК ДатаЗапрета";
			Запрос.УстановитьПараметр("Организация"+индекс, КлючИЗначение.Ключ);
			ГраницаПериода = КлючИЗначение.Значение;
			Запрос.УстановитьПараметр("ДатаЗапрета"+индекс, ?(ГраницаПериода=Неопределено, NULL, ГраницаПериода));
			индекс = индекс + 1;
		КонецЦикла;
	Иначе
		ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
		ИмяПоляОрганизации = "&ПустаяОрганизация";
		ВложенныйЗапрос = "ВЫБРАТЬ &ПустаяОрганизация КАК Организация, &ДатаЗапрета КАК ДатаЗапрета";
		Запрос.УстановитьПараметр("ПустаяОрганизация", ПустаяОрганизация);
		
		ГраницаПериода = СтруктураПараметров.СоответствиеГраницЗапрета[ПустаяОрганизация];
		
		// БИТ_ЖКХ 13.02.2015{{
		Если ГраницаПериода = Неопределено Тогда
			
			ГраницаПериода = Дата("00010101");
			
		КонецЕсли;
		// БИТ_ЖКХ 13.02.2015}}
		
		Запрос.УстановитьПараметр("ДатаЗапрета", ?(ГраницаПериода=Неопределено, NULL, ГраницаПериода));			
	КонецЕсли;			
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 1
	|ИЗ
	|(
	|ВЫБРАТЬ " + ИмяПоляОрганизации + " КАК Организация, МИНИМУМ(Период) КАК Период  ИЗ " + ИмяРегистра + " КАК Набор
	|ГДЕ Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО " + ИмяПоляОрганизации + "
	|) КАК НаборЗаписей
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|(" + ВложенныйЗапрос + "		
	|) КАК ДатыЗапрета
	|ПО НаборЗаписей.Организация = ДатыЗапрета.Организация
	|ГДЕ НаборЗаписей.Период <= ДатыЗапрета.ДатаЗапрета ИЛИ ДатыЗапрета.ДатаЗапрета ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Регистратор", НаборЗаписей.Отбор.Регистратор.Значение);				
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПроверкаСуществующихЗаписейРегистра()

#КонецОбласти
